app/views/questions/index.html.erb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
  <% @questions.each do |question| %>
    <%= question.answers.count %> (answers) <%= link_to "#{question.title}", question_path(question) %><br><hr>