app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 21]]
---
  def new
    @answer = Answer.new
    @question = Question.find(params[:question_id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 21]]
INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "agreed."], ["user_id", 11], ["question_id", 21], ["created_at", "2015-02-08 03:38:22.991313"], ["updated_at", "2015-02-08 03:38:22.991313"]]
---
  def create
    @answer = Answer.new(answer_params)
    @question = Question.find(params[:question_id])
    current_user.answers << @answer

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 41]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 21]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 41]]
---
  def destroy
    @answer = Answer.find(params[:id])
    @question = Question.find(@answer.question_id)
    @answer.destroy