app/controllers/comments_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 42]]
---
  def new
    @comment = Comment.new
    @answer = Answer.find(params[:commentable_id])

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 42]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "holla back!"], ["user_id", 11], ["created_at", "2015-03-01 21:04:45.851659"], ["updated_at", "2015-03-01 21:04:45.851659"]]
---
  def create
    @comment = Comment.new(comment_params)
    @answer = Answer.find(params[:commentable_id])
    current_user.comments << @comment

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 61]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 61]]
---
  def destroy
    comment = Comment.find(params[:id])
    @question = Question.find(@answer.question.id)
    comment.destroy

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 42]]
---
  def set_answer
    @answer = Answer.find(params[:answer_id])