app/controllers/questions_controller.rb

  def create
    @question = Question.create(question_params)
---
INSERT INTO "questions" ("title", "prompt", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "how awesome is grilled cheese?"], ["prompt", "too awesome"], ["user_id", 11], ["created_at", "2015-02-08 03:37:56.457850"], ["updated_at", "2015-02-08 03:37:56.457850"]]

  def update
    @question = Question.find(params[:id])
    @question.update!(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "how awesome is grilled cheese? :)"], ["updated_at", "2015-02-08 03:38:12.817173"], ["id", 21]]