app/controllers/sessions_controller.rb

SELECT "users".* FROM "users"
---
  def create
    user = User.all.find do |u|