app/controllers/votes_controller.rb

INSERT INTO "votes" ("votable_id", "votable_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["votable_id", 11], ["votable_type", "Answer"], ["user_id", 11], ["created_at", "2015-02-09 13:41:44.029106"], ["updated_at", "2015-02-09 13:41:44.029106"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @vote = Vote.create(votable_id: @answer.id, votable_type: Answer, user_id: current_user.id)
    @question = Question.find(@answer.question_id)

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 11]]
---
    def set_answer
      @answer = Answer.find(params[:answer_id])